import task1 # Задача 1. Калькулятор опыта
#import task2 # Задача 2. Максимум из трёх чисел 2
#import task3 # Задача 3. Функция
#import task4 # Задача 4. Поступление
#import task5 # Задача 5. Ресторан
#import task6 # Задача 6. Свободная касса!
#import task7 # Задача 7. Защита от дурака
#import task8 # Задача 8. Перемена
#import task9 # Задача 9. Опять двойка
#import task10 # Задача 10. Защита от дурака 2
#import task11 # Задача 11. Костя хочет выигрывать
#import task12 # Задача 12. Ленивый бизнес
#import task13 # Задача 13. Новоселье
#import task14 # Задача 14. Прогрессивный налог 2
#import task15_var2 # Задача 15. Почта - вариант 1
#import task15_var1 # Задача 15. Почта - вариант 2