# Задача 9. Выражение
# Дано число x. Напишите программу для вычисления следующего выражения (см. в задании)
x = int(input('Введите число X: '))
totalNumerator = 1
totalDenominator = 1
for number in range(1, 65):
    numNumber = number * 2 - 1
    denomNumber = 
    numerator = x - number * 2 + 1 #
    totalNumerator *= numerator #
    denominator = x - number * 2 #
    totalDenominator *= denominator #
    print(numNumber)

